<?xml version="1.0" encoding="utf-8" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="fr" lang="fr">

<head>
<title>Licences - Projet GNU - Free Software Foundation/Fondation pour la Logiciel Libre (FSF)</title>
<meta http-equiv="content-type" content='text/html; charset=utf-8' />
<link rel="stylesheet" type="text/css" href="/gnu.css" />
<link rev="made" href="webmasters&#64;gnu.org" />
<link rev="translated" href="mailto:trad-gnu&#64;april.org" />
</head>

<!-- This document is in XML, and xhtml 1.0 -->
<!-- Please make sure to properly nest your tags -->
<!-- and ensure that your final document validates -->
<!-- consistent with W3C xhtml 1.0 and CSS standards -->
<!-- See validator.w3.org -->

<body>

<p><a href="#translations">Traductions</a> de cette page</p>
<h3>Licences</h3>
<!-- When you replace this graphic, make sure you change -->
<!-- the link to also point to the correct HTML page. -->
<!-- If you make a new graphic for this page, make sure it -->
<!-- has a corresponding entry in /graphics/graphics.html. -->

<p>

<a href="/graphics/philosophicalgnu.html"><img src="/graphics/philosophical-gnu-sm.jpg" alt=" [Image d'un Gnu philosophe] " /></a></p>

<hr />
<h4>Table des mati&egrave;res</h4>

<ul>
  <li><a href="#Intro" id="TOCIntro">Introduction</a></li>
  <li><a href="#GPL" id="TOCGPL">La Licence publique g&eacute;n&eacute;rale (GPL) de GNU</a></li>
  <li><a href="#LGPL" id="TOCLGPL">La Licence publique g&eacute;n&eacute;rale amoindrie (LGPL) de GNU</a></li>
  <li><a href="#FDL" id="TOCFDL">La Licence de Documentation Libre (FDL) de GNU</a></li>
  <li><a href="#Translations2" id="TOCTranslations2">Traductions non officielles</a></li>
  <li><a href="#VerbatimCopying" id="TOCVerbatimCopying">Copie et distribution conforme (verbatim)</a></li>
  <li><a href="#LicenseList" id="TOCLicenseList">Liste des licences de logiciels libres</a></li>
  <li><a href="#WhatIsCopyleft" id="TOCWhatIsCopyleft">Qu'entend-on par &laquo;copyleft&raquo;, ou &laquo;gauche d'auteur&raquo;?</a></li>
  <li><a href="/licensing/classpath/" id="TOCRelicensingWiki">Le wiki Classpath Relicensing</a></li>
  <li><a href="#OtherWorks" id="TOCOtherWorks">Licences pour d'autres types d'&oelig;uvre</a></li>
</ul>
<hr />

<h3><a href="#TOCIntro" id="Intro">Introduction</a></h3>
<p>
Les logiciels publi&eacute; devraient &ecirc;tre des <a
href="/philosophy/free-sw.fr.html">logiciels libres</a>.  Pour rendre un
logiciel libre, vous devez le diffuser sous les termes d'une licence
de logiciel libre. Nous utilisons normalement la <a href="#GPL">GNU General Public License</a> (GNU GPL),
mais occasionnellement nous utilisons d'<a href="#LicenseList">autres licences de logiciel libre</a>.
Pour les logiciels du projet GNU, nous utilisons uniquement
des licences compatibles avec la GNU GPL.</p>
<p>
La documentation pour les
logiciels libres devraient &ecirc;tre de la <a href="/philosophy/free-doc.fr.html">documentation libre</a>, de
fa&ccedil;on &agrave; que les gens puissent la redistribuer et
l'am&eacute;liorer avec le logiciel qu'elle d&eacute;crit. Pour rendre
une documentation libre, vous devez la diffuser sous les termes d'une
licence de documentation libre. Nous utilisons normalement la <a href="#FDL">GNU Free Documentation License</a> (GNU
FDL), mais occasionnellement nous utilisons d'<a href="#LicenseList">autres licences de documentation libre</a>.</p>

<h3><a href="#TOCGPL" id="GPL">La Licence publique g&eacute;n&eacute;rale (GPL) de GNU</a></h3>
<p>La Licence publique g&eacute;n&eacute;rale de GNU (en anglais General Public License) est souvent appel&eacute;e de l'acronyme &laquo;GNU GPL&raquo; ou &laquo;GPL de GNU&raquo;. C'est la licence de la plupart des programmes GNU et de plus de la moiti&eacute; de l'ensemble des logiciels libres actuellement distribu&eacute;s.</p>

<p>
La GNU GPL est actuellement en cours de r&eacute;vision et vos commentaires sur le texte propos&eacute;
sont les bienvenus. Veuillez consulter <a href="http://gplv3.fsf.org">http://gplv3.fsf.org</a> pour
lire le texte en pr&eacute;paration et participer au processus.
</p>

<ul>
  <li>Le texte de la Licence Publique G&eacute;n&eacute;rale de GNU
      au format <a href="/licenses/gpl.html">HTML</a>,
      au format <a href="/licenses/gpl.txt">texte</a>,
      au format <a href="/licenses/gpl.texi">Texinfo</a> et
      au format <a href="/licenses/gpl-2.0.tex">LaTeX</a>.Ces documents ne sont pas format&eacute;s pour &ecirc;tre publi&eacute;s isol&eacute;ment, et
sont destin&eacute;s &agrave; &ecirc;tre inclus dans un autre document.</li>
  <li><a href="/licenses/gpl-faq.fr.html">La foire aux questions (FAQ) de la GPL de GNU</a></li>
  <li><a href="/licenses/gpl-howto.fr.html">Comment utiliser la GPL de GNU pour vos propres programmes.</a></li>
  <li><a href="/licenses/why-assign.fr.html">Pourquoi la FSF demande &agrave; ses contributeurs une attribution du droit de copie</a></li>
  <li><a href="/licenses/gpl-violation.html">Que faire si vous constatez une violation de la GPL, de la LGPL ou de la FDL de GNU.</a></li>
  <li><a href="/philosophy/university.fr.html">Diffuser du logiciel libre si vous travaillez dans une universit&eacute;</a></li>
</ul>

<h3><a href="#TOCLGPL" id="LGPL">La Licence publique g&eacute;n&eacute;rale amoindrie (LGPL) de GNU</a></h3>
<p>
La Licence publique g&eacute;n&eacute;rale amoindrie de GNU est adopt&eacute;e par certaines biblioth&egrave;ques de composants - mais pas par toutes. Au d&eacute;part cette licence &eacute;tait d&eacute;sign&eacute;e sous le terme de &laquo;GPL pour les biblioth&egrave;ques&raquo; (Library GPL). Nous avons chang&eacute; l'appellation parce que l'ancienne avait tendance &agrave; trop encourager les auteurs de biblioth&egrave;ques de composants &agrave; l'utiliser.</p>

<ul>
  <li>Le texte de la Licence publique g&eacute;n&eacute;rale amoindrie de GNU, au format
      <a href="/licenses/lgpl.html">HTML</a>, au format
      <a href="/licenses/lgpl.txt">texte</a>, et au format
      <a href="/licenses/lgpl.texi">Texinfo</a>.
Ces documents ne sont pas format&eacute;s pour &ecirc;tre publi&eacute;s isol&eacute;ment, et
sont destin&eacute;s &agrave; &ecirc;tre inclus dans un autre document.</li>
  <li><a href="/licenses/why-not-lgpl.fr.html">Pourquoi il vaut mieux ne pas utiliser la LGPL pour votre prochaine biblioth&egrave;que de composants.</a></li>
  <li><a href="/licenses/gpl-violation.html">Que faire si vous constatez une violation de la GPL, de la LGPL ou de la FDL de GNU.</a></li>
</ul>

<h3><a href="#TOCFDL" id="FDL">La Licence de documentation libre (FDL) de GNU</a></h3>
<p>
La Licence de documentation libre de GNU est une forme de copyleft destin&eacute;e aux manuels, aux recueils de textes et autres documents. Son objectif est de garantir &agrave; tous la possibilit&eacute; effective de copier et de redistribuer librement le document avec ou sans modifications, et que ce soit ou non dans un but commercial.</p>

<ul>
  <li>Le texte de la Licence de documentation libre de GNU, aux formats 
      <a href="/licenses/fdl.html">HTML</a>,
      <a href="/licenses/fdl.txt">texte</a>,
      <a href="/licenses/fdl.texi">Texinfo</a>,<a href="/licenses/fdl.tex">LaTeX</a>. Ces documents ne sont pas format&eacute;s pour &ecirc;tre publi&eacute;s isol&eacute;ment, et
sont destin&eacute;s &agrave; &ecirc;tre inclus dans un autre document.</li>
  <li><a href="/licenses/why-gfdl.fr.html">Pourquoi les &eacute;diteurs devraient utiliser la FDL de GNU</a></li>
  <li><a href="/licenses/fdl.html#SEC4">Comment utiliser la FDL de GNU pour vos documents</a></li>
  <li><a href="/licenses/fdl-howto.fr.html">Astuces pour l'utilisation de la FDL de GNU</a></li>
  <li><a href="/licenses/fdl-howto-opt.html">Comment utiliser les fonctionnalit&eacute;s suppl&eacute;mentaires de la FDL de GNU</a></li>
  <li><a href="/licenses/gpl-violation.html">Que faire si vous constatez une violation de la GPL, de la LGPL ou de la FDL de GNU</a></li>
  <li><a href="/licenses/old-licenses/old-licenses.html#FDL">Anciennes versions de la FDL de GNU</a></li>
</ul>

<h3><a href="#TOCTranslations2" id="Translations2">Traductions non officielles</a></h3>
<p>
Juridiquement parlant, la version originale - en anglais - de la GPL est celle qui d&eacute;crit exactement les conditions de distribution des programmes GNU. Cependant, pour aider &agrave; une meilleure compr&eacute;hension des licences, nous autorisons la publication de traductions dans d'autres langues, &agrave; condition que ces traductions respectent notre protocole pour les traductions non officielles.</p>
<ul>
  <li><a href="/licenses/translations.fr.html">Liste de traductions non officielles</a></li>
  <li><a href="/licenses/translations.fr.html#rules">Comment cr&eacute;er une traduction non officielle</a></li>
</ul>

<h3><a href="#TOCVerbatimCopying" id="VerbatimCopying">Copie et distribution conforme (verbatim)</a></h3>
<p>
La notice de copyright standard pour les pages web de GNU est :
<em>Verbatim copying and distribution of this entire article are
permitted worldwide without royalty in any medium, provided this notice is preserved.</em> (en
fran&ccedil;ais: <em>La reproduction exacte et la distribution
int&eacute;grale de cet article sont autoris&eacute;es dans le monde entier
 sans redevance et sur tous
supports pourvu que la pr&eacute;sente notice soit
pr&eacute;serv&eacute;e. </em>). Noter le commentaire suivant d'Eben Moglen :</p>
<p>
&laquo;Notre intention dans la phrase `verbatim copying in any medium' n'est
pas d'obliger la r&eacute;tention des en-t&ecirc;tes et des pieds de page, ou
d'autres mises en forme graphique. La r&eacute;tention des liens
hypertextes &agrave; la fois sur les supports de type hypertextes ou
non (tels que les notes ou les URL imprim&eacute;es dans des medias
non-HTML) est requise.&raquo;</p>

<h3><a href="#TOCLicenseList" id="LicenseList">Liste des licences de logiciels libres</a></h3>

<ul>
  <li><a href="/licenses/license-list.fr.html">Liste des licences de logiciels libres</a>
<p>
Si vous envisager d'&eacute;crire une nouvelle licence, veuillez contacter la FSF
en &eacute;crivant &agrave; <a href="mailto:licensing&#64;gnu.org">&lt;licensing&#64;gnu.org&gt;</a>. La prolif&eacute;ration de diff&eacute;rentes
licences de logiciels libres implique un travail grandissant pour les utilisateurs dans la compr&eacute;hension
des licences; nous pouvons vous aider &agrave; trouver une licence existante de logiciel libre
qui r&eacute;ponde &agrave; vos besoins.
</p>
<p>
Si ce n'est pas possible, si vous avez vraiment besoin d'une nouvelle licence, avec notre
aide, vous pouvez vous assurer que la licence est vraiment une licence de logiciel libre
et &eacute;viter divers probl&egrave;mes pratiques.
</p>
</li>
</ul>

<h3><a href="#TOCWhatIsCopyleft" id="WhatIsCopyleft">Qu'entend-on par &laquo;Copyleft&raquo;, ou &laquo;gauche d'auteur&raquo;?</a></h3>

<p>Le <em>Copyleft</em> est un cadre permettant de faire d'un programme un logiciel libre et d'exiger que les versions modifi&eacute;es ou &eacute;tendues deviennent elles aussi des logiciels libres.</p>
<p>
Le moyen le plus simple pour faire d'un programme un logiciel libre est de le placer dans le <a href="/philosophy/categories.fr.html#PublicDomainSoftware">domaine public (18 Ko)</a>, sans aucune licence de droit de copie. Une telle publication permet effectivement aux personnes bien intentionn&eacute;es de s'&eacute;changer le programme ainsi que d'&eacute;ventuelles am&eacute;liorations. Malheureusement elle permet aussi &agrave; des personnes &agrave; l'esprit peu coop&eacute;ratif de transformer le programme en <a href="/philosophy/categories.fr.html#ProprietarySoftware">logiciel propri&eacute;taire (18 Ko)</a>. Ces personnes peuvent &eacute;crire des modifications, beaucoup de modifications, ou bien un petit peu, puis le distribuer en tant que produit propri&eacute;taire. Les gens qui re&ccedil;oivent le logiciel sous sa forme modifi&eacute;e ne disposent plus des libert&eacute;s que l'auteur leur avait donn&eacute;es &agrave; l'origine : un interm&eacute;diaire s'est interpos&eacute; et les a supprim&eacute;es.</p>
<p>
En ce qui concerne le <a href="/gnu/thegnuproject.fr.html">projet GNU</a>, nous voulons garantir &agrave; <em>tous</em> les utilisateurs la possibilit&eacute; de redistribuer et de modifier les logiciels. Si des interm&eacute;diaires pouvaient supprimer ces libert&eacute;s, nous aurions peut-&ecirc;tre plus d'utilisateurs mais ces utilisateurs n'auraient pas les libert&eacute;s que nous voulons leur donner. Alors, au lieu de placer les logiciels GNU dans le domaine public, nous les mettons sous &laquo;gauche d'auteur&raquo;. La gauche d'auteur (copyleft) &eacute;nonce que quiconque redistribue le logiciel, avec ou sans modifications, doit transmettre aussi la libert&eacute; de copier et de modifier ce logiciel. Le copyleft est une garantie des libert&eacute;s de tous les utilisateurs.</p>
<p>
Le copyleft constitue aussi un <a href="/philosophy/pragmatic.fr.html">moyen d'encourager</a> d'autres programmeurs &agrave; contribuer aux logiciels libres. D'importants programmes libres comme le compilateur GNU C++ n'existeraient pas sans cela.</p>
<p>Le copyleft aide les programmeurs qui souhaitent contribuer &agrave; <a href="/software/software.html#HelpWriteSoftware">am&eacute;liorer</a> les 
<a href="/philosophy/free-sw.fr.html">logiciels libres</a> &agrave; obtenir la permission de le faire. En effet, ces programmeurs travaillent souvent pour les entreprises ou pour les universit&eacute;s et celles-ci feraient presque n'importe quoi pour obtenir de l'argent. Si un programmeur ou une programmeuse d&eacute;sire contribuer &agrave; l'&oelig;uvre commune, il se peut que son employeur veuille au contraire tirer parti de ce travail par la vente d'une licence de logiciel propri&eacute;taire.</p>
<p>
Quand nous expliquons &agrave; l'employeur qu'il est ill&eacute;gal de redistribuer la version am&eacute;lior&eacute;e autrement que sous la forme d'un logiciel libre, ce qui se passe habituellement c'est que l'employeur pr&eacute;f&egrave;re tout de m&ecirc;me le publier comme logiciel libre plut&ocirc;t que de tout jeter.</p>
<p>
Pour placer un programme sous gauche d'auteur, nous commen&ccedil;ons par &eacute;noncer le droit de copie, puis nous y ajoutons les conditions de distribution. Celles-ci constituent un instrument juridique donnant &agrave; toute personne le droit d'utiliser, de modifier et de redistribuer le code du programme <em>ou de tout programme d&eacute;riv&eacute;</em>, sous r&eacute;serve que les conditions distribution demeurent inchang&eacute;es. Ainsi, le code et les libert&eacute;s attenantes deviennent juridiquement ins&eacute;cables.</p>
<p>
Les d&eacute;veloppeurs de logiciels propri&eacute;taires utilisent le droit de copie pour priver les utilisateurs de leurs libert&eacute;s. De notre c&ocirc;t&eacute;, nous l'utilisons pour garantir ces libert&eacute;s. Voil&agrave; pourquoi nous avons invers&eacute; le mot &laquo;copyright&raquo; (&laquo;droit d'auteur&raquo;) en &laquo;copyleft&raquo; (&laquo;gauche d'auteur&raquo;).</p>
<p>
Le copyleft est un concept d'une port&eacute;e g&eacute;n&eacute;rale et peut &ecirc;tre d&eacute;clin&eacute; de diverses mani&egrave;res. En ce qui concerne le projet GNU, les conditions sp&eacute;cifiques de distribution que nous utilisons sont &eacute;nonc&eacute;es par la Licence publique g&eacute;n&eacute;rale (GPL), la Licence publique g&eacute;n&eacute;rale amoindrie (LGPL) et la Licence de documentation libre (FDL) de GNU.</p>
<p>
Le texte de la licence appropri&eacute;e est pr&eacute;sent dans de nombreux manuels et dans chacune des distributions de code source du projet GNU.</p>
<p>
La GPL de GNU a &eacute;t&eacute; con&ccedil;ue pour que vous puissiez
facilement l'appliquer &agrave; votre programme si vous en &ecirc;tes
l'auteur. Il n'est pas n&eacute;cessaire de modifier le texte de la
licence, il vous suffit d'ins&eacute;rer des notices faisant
r&eacute;f&eacute;rence &agrave; la licence GPL. Attention, pour
placer votre programme sous GPL vous devez imp&eacute;rativement
utiliser le texte int&eacute;gral de la licence. Elle forme un tout,
la copie partielle n'est pas autoris&eacute;e. (De m&ecirc;me pour la
LGPL ou la FDL).</p>
<p>
Le fait d'utiliser les m&ecirc;mes conditions de distribution pour de nombreux programmes diff&eacute;rents facilite la recopie de code entre divers programmes. En effet, si les termes de distribution sont identiques, on n'a plus besoin de se poser de questions sur la compatibilit&eacute; des conditions de distribution. La GPL amoindrie comprend une clause permettant de modifier les termes de distribution en faveur de la GPL normale, ce qui permet aussi de recopier du code dans un programme sous GPL.</p>

<h3><a href="#TOCOtherWorks" id="OtherWorks">Licences pour d'autres types d'&oelig;uvres</a></h3>
<p>
Nous pensons que le logiciel et la documentation publi&eacute;s
devraient &ecirc;tre du <a href="#Intro">logiciel libre et de la documentation
libre</a>. Nous recommandons que les &oelig;uvres de
r&eacute;f&eacute;rence et les &oelig;uvres &eacute;ducatives soient libres
&eacute;galement, en utilisant les licences de documentation libre
telle que la <a href="#FDL">GNU Free Documentation
License</a> (GNU FDL).</p>
<p>
Pour des essais d'opinion et des articles scientifiques, nous recommandons la
simple licence &laquo;verbatim copying only&raquo; (&laquo;copie int&eacute;grale uniquement&raquo;)
qui est utilis&eacute;e pour cette page Web.
</p>
<p>
Nous ne sommes pas convaincus que les &oelig;uvres artistiques ou de divertissement doivent &ecirc;tre
libres, mais si vous voulez en rendre une libre, nous recommandons
la <a href="http://artlibre.org/licence/lalgb.html">Free Art
License</a> (Licence Art libre).
</p>

<hr />
 
<!-- If needed, change the copyright block at the bottom. In general, -->
<!-- all pages on the GNU web server should have the section about    -->
<!-- verbatim copying.  Please do NOT remove this without talking     -->
<!-- with the webmasters first. --> 
<!-- Please make sure the copyright date is consistent with the document -->
<!-- and that it is like this "2001, 2002" not this "2001-2002." -->

<div class="translations">
<p><a id="translations"></a>
<b>Traductions de cette page</b>&nbsp;:<br />

<!-- Please keep this list alphabetical, and in the original -->
<!-- language if possible, otherwise default to English -->
<!-- If you do not have it English, please comment what the -->
<!-- English is.  If you add a new language here, please -->
<!-- advise web-translators&#64;gnu.org and add it to -->
<!--    - in /home/www/bin/nightly-vars either TAGSLANG or WEBLANG -->
<!--    - in /home/www/html/server/standards/README.translations.html -->
<!--      one of the lists under the section "Translations Underway" -->
<!--    - if there is a translation team, you also have to add an alias -->
<!--      to mail.gnu.org:/com/mailer/aliases -->
<!-- Please also check you have the 2 letter language code right versus -->
<!--     http://www.w3.org/WAI/ER/IG/ert/iso639.htm -->

[
  <a href="/licenses/licenses.ca.html">Catal&#x00e0;</a> <!-- Catalan -->
| <a href="/licenses/licenses.cn.html">&#x7b80;&#x4f53;&#x4e2d;&#x6587;</a>	<!-- Chinese (Simplified) -->
| <a href="/licenses/licenses.zh.html">&#x7e41;&#x9ad4;&#x4e2d;&#x6587;</a>	<!-- Chinese (Traditional) -->
| <a href="/licenses/licenses.html">English</a>
| <a href="/licenses/licenses.es.html">Espa&#x00f1;ol</a>	<!-- Spanish -->
| <a href="/licenses/licenses.fr.html">Fran&#x00e7;ais</a>	<!-- French -->
| <a href="/licenses/licenses.ja.html">&#x65e5;&#x672c;&#x8a9e;</a>	<!-- Japanese -->
| <a href="/licenses/licenses.pl.html">Polski</a>		<!-- Polish -->
| <a href="/licenses/licenses.pt.html">Portugu&#x0ea;s</a>		<!-- Portuguese -->
| <a href="/licenses/licenses.sr.html">&#x0421;&#x0440;&#x043f;&#x0441;&#x043a;&#x0438;</a> <!-- Serbian -->
]
</p>
</div>

<div class="copyright">
<p>Retournez &agrave; <a href="/home.fr.html">la page
principale du projet GNU</a>.
</p>

<p>Pour les questions et requ&ecirc;tes relatives &agrave; la FSF &amp;
GNU&nbsp;: <a href="mailto:gnu&#64;gnu.org"><em>gnu&#64;gnu.org</em></a>. Autres <a href="/home.fr.html#ContactInfo">moyens pour contacter</a> la
FSF.
Merci d'envoyer des commentaires sur cette page web &agrave; <a href="mailto:webmasters&#64;gnu.org"><em>webmasters&#64;gnu.org</em></a>,
envoyer une autre question &agrave; <a href="mailto:gnu&#64;gnu.org"><em>gnu&#64;gnu.org</em></a>.
</p>

<p>Copyright &copy; 1996, 1997, 1998, 1999, 2001, 2002, 2003, 2004, 2005, 2006 Free Software Foundation, Inc.,
51 Franklin St, Fifth Floor, Boston, MA 02110-1301, USA
</p>

<p>Verbatim copying and distribution of this entire article is
permitted in any medium, provided this notice is preserved.
</p>

<p>La reproduction exacte et la distribution int&eacute;grale de cet
article est
permise sur n'importe quel support d'archivage, pourvu que cette notice soit pr&eacute;serv&eacute;e.</p>
<p>
Derni&egrave;re mise-&agrave;-jour&nbsp;:
<!-- hhmts start -->
$Date: 2006/06/20 08:34:14 $  $Author: taz $
</p>
<!-- timestamp end -->
<p>
Traduction&nbsp;: <a href="mailto:obenassy&#64;april.org">Odile B&eacute;nassy</a><br />
R&eacute;vision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>
</p>
</div>
</body></html>
